TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/m33/hw_eam.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_eam__include
#define ti_devices_msp_peripherals_hw_eam__include

/* This preliminary header file does not have a version number */
/* Filename: hw_eam.h */
/* MMR revised: 2025-04-09 14:12:34 */
/* MMR repo: https://bitbucket.itg.ti.com/projects/cmcu_msp65soc/repos/m33c1 */
/* MMR revision: f4602b816b1643a266cc7aae6be755d35f394359 */
/* Generator revision: ee5e56ed8e50e22306abbffa1ce64d23abbf32b9
   (MInT: 1818019a64e181dbbfd48fdc69fea15367af4c13) */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* EAM Registers
******************************************************************************/
#define EAM_EAM_REGS_OFS                         ((uint32_t)0x00000000U)


/** @addtogroup EAM_EAM_REGS
  @{
*/

typedef struct {
  __IO uint32_t Reserved_1[1024];                  /* !< (@ 0x00000000) Reserved */
  __IO uint32_t REVISION;                          /* !< (@ 0x00001000) IP revision id register */
  __IO uint32_t Reserved_2[3];                     /* !< (@ 0x00001004) Reserved */
  __IO uint32_t SECURITY_ERR_FLAG;                 /* !< (@ 0x00001010) Security error flag */
  __IO uint32_t SECURITY_ERR_CLR;                  /* !< (@ 0x00001014) Security error clear */
  __IO uint32_t SECURITY_ERR_MSTID;                /* !< (@ 0x00001018) Security error master id */
  __IO uint32_t SECURITY_ERR_ADDR;                 /* !< (@ 0x0000101C) Security error address */
  __IO uint32_t Reserved_3[4];                     /* !< (@ 0x00001020) Reserved */
  __IO uint32_t FRI_SEC_FLAG;                      /* !< (@ 0x00001030) FRI SEC flag */
  __IO uint32_t FRI_SEC_CLR;                       /* !< (@ 0x00001034) FRI SEC clear */
  __IO uint32_t FRI_SEC_ADDR;                      /* !< (@ 0x00001038) FRI SEC address */
  __IO uint32_t FRI_SEC_MSTID;                     /* !< (@ 0x0000103C) FRI SEC master id */
  __IO uint32_t Reserved_4[4];                     /* !< (@ 0x00001040) Reserved */
  __IO uint32_t FRI_DED_FLAG;                      /* !< (@ 0x00001050) FRI DED flag */
  __IO uint32_t FRI_DED_CLR;                       /* !< (@ 0x00001054) FRI DED clear */
  __IO uint32_t FRI_DED_ADDR;                      /* !< (@ 0x00001058) FRI DED address */
  __IO uint32_t FRI_DED_MSTID;                     /* !< (@ 0x0000105C) FRI DED master id */
  __IO uint32_t Reserved_5[4];                     /* !< (@ 0x00001060) Reserved */
  __IO uint32_t SYSMEM_SEC_FLAG;                   /* !< (@ 0x00001070) SYSMEM SEC flag */
  __IO uint32_t SYSMEM_SEC_CLR;                    /* !< (@ 0x00001074) SYSMEM SEC clear */
  __IO uint32_t SYSMEM_SEC_ADDR;                   /* !< (@ 0x00001078) SYSMEM SEC address */
  __IO uint32_t SYSMEM_SEC_MSTID;                  /* !< (@ 0x0000107C) SYSMEM SEC master id */
  __IO uint32_t Reserved_6[4];                     /* !< (@ 0x00001080) Reserved */
  __IO uint32_t SYSMEM_DED_FLAG;                   /* !< (@ 0x00001090) SYSMEM DED flag */
  __IO uint32_t SYSMEM_DED_CLR;                    /* !< (@ 0x00001094) SYSMEM DED clear */
  __IO uint32_t SYSMEM_DED_ADDR;                   /* !< (@ 0x00001098) SYSMEM DED address */
  __IO uint32_t SYSMEM_DED_MSTID;                  /* !< (@ 0x0000109C) SYSMEM DED master id */
  __IO uint32_t Reserved_7[984];                   /* !< (@ 0x000010A0) Reserved */
} EAM_EAM_REGS_Regs;

/*@}*/ /* end of group EAM_EAM_REGS */

