TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/m33/hw_eam.h
/* EAM_FRI_DED_CLR Bits */
/* EAM_FRI_DED_CLR[SEC] Bits */
#define EAM_FRI_DED_CLR_SEC_OFS                  (0)                             /* !< SEC Offset */
#define EAM_FRI_DED_CLR_SEC_MASK                 ((uint32_t)0x00000001U)         /* !< writing '1' will clear
                                                                                    FRI_DED_FLAG[DED] register. */
/* EAM_FRI_DED_CLR[DIAG_DED] Bits */
#define EAM_FRI_DED_CLR_DIAG_DED_OFS             (1)                             /* !< DIAG_DED Offset */
#define EAM_FRI_DED_CLR_DIAG_DED_MASK            ((uint32_t)0x00000002U)         /* !< writing '1' will clear
                                                                                    FRI_DED_FLAG[DIAG_DED] register. */

/* EAM_FRI_DED_ADDR Bits */
/* EAM_FRI_DED_ADDR[ADDRESS] Bits */
#define EAM_FRI_DED_ADDR_ADDRESS_OFS             (0)                             /* !< ADDRESS Offset */
#define EAM_FRI_DED_ADDR_ADDRESS_MASK            ((uint32_t)0xFFFFFFFFU)         /* !< Single error correction error
                                                                                    address. This field will be cleared
                                                                                    along with the corresponding flag
                                                                                    clear. */

/* EAM_FRI_DED_MSTID Bits */
/* EAM_FRI_DED_MSTID[MSTID] Bits */
#define EAM_FRI_DED_MSTID_MSTID_OFS              (0)                             /* !< MSTID Offset */
#define EAM_FRI_DED_MSTID_MSTID_MASK             ((uint32_t)0x000000FFU)         /* !< Single error correction error
                                                                                    master ID. This field will be cleared
                                                                                    along with the corresponding flag
                                                                                    clear. */

/* EAM_SYSMEM_SEC_FLAG Bits */
/* EAM_SYSMEM_SEC_FLAG[RD_SEC] Bits */
#define EAM_SYSMEM_SEC_FLAG_RD_SEC_OFS           (0)                             /* !< RD_SEC Offset */
#define EAM_SYSMEM_SEC_FLAG_RD_SEC_MASK          ((uint32_t)0x00000001U)         /* !< Single error correction error
                                                                                    during read */
/* EAM_SYSMEM_SEC_FLAG[WR_SEC] Bits */
#define EAM_SYSMEM_SEC_FLAG_WR_SEC_OFS           (1)                             /* !< WR_SEC Offset */
#define EAM_SYSMEM_SEC_FLAG_WR_SEC_MASK          ((uint32_t)0x00000002U)         /* !< diagnostic single error correction
                                                                                    error during write */

/* EAM_SYSMEM_SEC_CLR Bits */
/* EAM_SYSMEM_SEC_CLR[RD_SEC] Bits */
#define EAM_SYSMEM_SEC_CLR_RD_SEC_OFS            (0)                             /* !< RD_SEC Offset */
#define EAM_SYSMEM_SEC_CLR_RD_SEC_MASK           ((uint32_t)0x00000001U)         /* !< writing '1' will clear
                                                                                    SYSMEM_SEC_FLAG[RD_SEC] register. */
/* EAM_SYSMEM_SEC_CLR[WR_SEC] Bits */
#define EAM_SYSMEM_SEC_CLR_WR_SEC_OFS            (1)                             /* !< WR_SEC Offset */
#define EAM_SYSMEM_SEC_CLR_WR_SEC_MASK           ((uint32_t)0x00000002U)         /* !< writing '1' will clear
                                                                                    SYSMEM_SEC_FLAG[WR_SEC] register. */

/* EAM_SYSMEM_SEC_ADDR Bits */
/* EAM_SYSMEM_SEC_ADDR[ADDRESS] Bits */
#define EAM_SYSMEM_SEC_ADDR_ADDRESS_OFS          (0)                             /* !< ADDRESS Offset */
#define EAM_SYSMEM_SEC_ADDR_ADDRESS_MASK         ((uint32_t)0xFFFFFFFFU)         /* !< Single error correction error
                                                                                    address. This field will be cleared
                                                                                    along with the corresponding flag
                                                                                    clear. */

/* EAM_SYSMEM_SEC_MSTID Bits */
/* EAM_SYSMEM_SEC_MSTID[MSTID] Bits */
#define EAM_SYSMEM_SEC_MSTID_MSTID_OFS           (0)                             /* !< MSTID Offset */
#define EAM_SYSMEM_SEC_MSTID_MSTID_MASK          ((uint32_t)0x000000FFU)         /* !< Single error correction error
                                                                                    master ID. This field will be cleared
                                                                                    along with the corresponding flag
                                                                                    clear. */

/* EAM_SYSMEM_DED_FLAG Bits */
/* EAM_SYSMEM_DED_FLAG[RD_DED] Bits */
#define EAM_SYSMEM_DED_FLAG_RD_DED_OFS           (0)                             /* !< RD_DED Offset */
#define EAM_SYSMEM_DED_FLAG_RD_DED_MASK          ((uint32_t)0x00000001U)         /* !< Double error detect error during
                                                                                    read */
/* EAM_SYSMEM_DED_FLAG[WR_DED] Bits */
#define EAM_SYSMEM_DED_FLAG_WR_DED_OFS           (1)                             /* !< WR_DED Offset */
#define EAM_SYSMEM_DED_FLAG_WR_DED_MASK          ((uint32_t)0x00000002U)         /* !< diagnostic Double error detect
                                                                                    error during write */

/* EAM_SYSMEM_DED_CLR Bits */
/* EAM_SYSMEM_DED_CLR[RD_DED] Bits */
#define EAM_SYSMEM_DED_CLR_RD_DED_OFS            (0)                             /* !< RD_DED Offset */
#define EAM_SYSMEM_DED_CLR_RD_DED_MASK           ((uint32_t)0x00000001U)         /* !< writing '1' will clear
                                                                                    SYSMEM_DED_FLAG[RD_DED] register. */
/* EAM_SYSMEM_DED_CLR[WR_DED] Bits */
#define EAM_SYSMEM_DED_CLR_WR_DED_OFS            (1)                             /* !< WR_DED Offset */
#define EAM_SYSMEM_DED_CLR_WR_DED_MASK           ((uint32_t)0x00000002U)         /* !< writing '1' will clear
                                                                                    SYSMEM_DED_FLAG[WR_DED] register. */

/* EAM_SYSMEM_DED_ADDR Bits */
/* EAM_SYSMEM_DED_ADDR[ADDRESS] Bits */
#define EAM_SYSMEM_DED_ADDR_ADDRESS_OFS          (0)                             /* !< ADDRESS Offset */
#define EAM_SYSMEM_DED_ADDR_ADDRESS_MASK         ((uint32_t)0xFFFFFFFFU)         /* !< Single error correction error
                                                                                    address. This field will be cleared
                                                                                    along with the corresponding flag
                                                                                    clear. */

/* EAM_SYSMEM_DED_MSTID Bits */
/* EAM_SYSMEM_DED_MSTID[MSTID] Bits */
#define EAM_SYSMEM_DED_MSTID_MSTID_OFS           (0)                             /* !< MSTID Offset */
#define EAM_SYSMEM_DED_MSTID_MSTID_MASK          ((uint32_t)0x000000FFU)         /* !< Single error correction error
                                                                                    master ID. This field will be cleared
                                                                                    along with the corresponding flag
                                                                                    clear. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_eam__include */

